app/controllers/sessions_controller.rb

SELECT "players".* FROM "players" WHERE "players"."name" = $1 LIMIT $2  [["name", "ashton"], ["LIMIT", 1]]
---
      def create
        user = Player.find_by(name: params[:name])