app/controllers/users_controller.rb

    def create
       player = Player.create(player_params)
---
INSERT INTO "players" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", nil], ["password_digest", "[FILTERED]"], ["created_at", "2022-11-15 16:45:48.797546"], ["updated_at", "2022-11-15 16:45:48.797546"]]